Revit 2024 API
SaveModifiedLinksOptionsForUnloadLocally Enumeration
 Class giving options when saving linked files which are unloaded locally and have been modified in-memory by shared coordinates operations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum SaveModifiedLinksOptionsForUnloadLocally
Visual Basic
Public Enumeration SaveModifiedLinksOptionsForUnloadLocally
Visual C++
public enum class SaveModifiedLinksOptionsForUnloadLocally
Members
Member name | Description
SaveLinks |  Any modified linked files will be saved.
DoNotSaveLinks |  Any modified linked files will not be saved. The links will return to their previous position the next time the file is loaded.
See Also
Autodesk.Revit.DB Namespace